{
    "timestamp": "2025-04-01 07:16:41",
    "all_news": [
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb9010d0e9e96c66c69573",
            "translated_facebook_post": "Harga Pi Coin hari ni (1 April) macam tengah berada di paras sokongan penting sekitar $0.62 hingga $0.68. Ada potensi untuk naik sikit, tapi kena tengok juga reaksi pasaran.  Kalau harga jatuh bawah paras ni, mungkin trend menurun akan berterusan.  Secara keseluruhannya, keadaan masih agak tak menentu.",
            "timestamp": "2025-04-01 07:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://www.ethnews.com/can-bitcoin-xrp-and-ethereum-turn-1k-into-100k-by-2025/",
            "translated_facebook_post": "Berita ni cakap pasal potensi Bitcoin, XRP, dan Ethereum untuk pulangkan pelaburan $1000 kepada $100,000 menjelang 2025.  Tapi,  ada satu lagi projek kripto, MAGACOINFINANCE, yang dikatakan berpotensi lebih tinggi untuk capai pulangan besar tu disebabkan pre-sale dia yang tengah berlangsung.  Selain tu,  ada juga info ringkas pasal ADA, OP, dan VET.",
            "timestamp": "2025-04-01 07:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb90116824c50f61af8e15",
            "translated_facebook_post": "CEO Coinbase nak pengguna stablecoin dapat faedah macam akaun simpanan biasa.  Sekarang ni undang-undang tak cukup updated, jadi CEO tu harap kerajaan Amerika ubah peraturan supaya pengguna boleh dapat untung.",
            "timestamp": "2025-04-01 07:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee55aec81759989ee06",
            "translated_facebook_post": "Kentucky dah tarik balik saman terhadap Coinbase pasal servis staking.  Ini susulan beberapa negeri lain buat benda sama, harap dapat peraturan yang lebih jelas di peringkat persekutuan untuk industri kripto ni.",
            "timestamp": "2025-04-01 06:58:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee4ce114f2936f74b18",
            "translated_facebook_post": "Lagi banyak kes penipuan mata wang kripto berlaku pada suku pertama tahun ni, kerugian mencecah $1.63 billion!  Lebih dua kali ganda berbanding tahun lepas.  Kebanyakan kerugian disebabkan dua kes besar, dan bursa mata wang kripto terjejas teruk.",
            "timestamp": "2025-04-01 06:56:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee5d0e9e96c66c69571",
            "translated_facebook_post": "Kentucky tarik balik saman terhadap Coinbase, ikut jejak South Carolina dan Vermont.  Berita baik ni bagi pasaran kripto, saham Coinbase pun naik 5.8%!  Ramai nampak potensi lebih ramai pelabur besar nak masuk bidang ni lepas kes ni selesai.  Kesimpulannya, situasi ni tunjuk perubahan positif dalam peraturan kripto di Amerika, dan ramai yang optimis tentang masa depan kripto.",
            "timestamp": "2025-04-01 06:56:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee5ce114f2936f74b1a",
            "translated_facebook_post": "UPBIT baru-baru ini mengadakan pameran seni \"Modernity 1900-1980\" yang memaparkan karya seni asli dari era penting dalam dunia seni.  Pameran ini menarik minat ramai dan dijangka akan meningkatkan lagi penglibatan budaya UPBIT, malah mungkin membuka peluang kerjasama dan memberi impak positif kepada imej syarikat.  Penganjuran pameran ini juga diharap dapat mendorong syarikat teknologi lain untuk turut serta dalam aktiviti seumpama ini.\n\n\nKesimpulan:  Pameran seni UPBIT berjaya menarik perhatian ramai dan dijangka akan membuka lebih banyak peluang serta mengukuhkan lagi imej syarikat.",
            "timestamp": "2025-04-01 06:52:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee56824c50f61af8e0f",
            "translated_facebook_post": "Dasar Trump nak kenakan tarif baru ni buat pasaran kripto agak goyang.  Harga Bitcoin, Ethereum, dan yang lain-lain dah jatuh minggu lepas.  Walaupun jangka pendek nampak gelap sikit,  jangka panjang mungkin cerah sebab dasar kerajaan  Amerika nampaknya positif terhadap kripto.  Kita tengok jelah macam mana nanti.",
            "timestamp": "2025-04-01 06:50:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8ee46824c50f61af8e0d",
            "translated_facebook_post": "Trump baru je tandatangan perintah eksekutif untuk percepatkan pelaburan dan urusan berkaitan Akta Cip.  Satu pejabat baharu akan ditubuhkan di Jabatan Perdagangan untuk memudahkan pelaburan besar, selaras dengan janji beliau untuk menarik lebih banyak pelaburan ke Amerika Syarikat.",
            "timestamp": "2025-04-01 06:50:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/headlines/news/ethereum-reclaims-no-1-spot-as-leading-dex-chain-for-first-since-september-overtakes-solana/",
            "translated_facebook_post": "Ethereum dah ambil balik tempat nombor satu sebagai rangkaian DEX terkemuka buat kali pertama sejak September lepas, mengatasi Solana.  Ini berlaku walaupun pasaran sekarang agak lembap, terutamanya dalam sektor memecoin.\n\n\nKesimpulan:  Ethereum kembali juara sebagai rangkaian DEX utama, mengatasi Solana, walaupun keadaan pasaran agak kurang memberangsangkan.",
            "timestamp": "2025-04-01 06:48:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8c73d0e9e96c66c69567",
            "translated_facebook_post": "Harga Ethereum jatuh banyak, sampai paras terendah dalam 4 tahun!  Yuran transaksi pun rendah sangat sekarang.  Walaupun ada yang positif macam yuran murah, ramai jual aset, dan guna platform layer-2.  Kena tengok macam mana perkembangan dia lepas ni.",
            "timestamp": "2025-04-01 06:48:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8c73d0e9e96c66c69565",
            "translated_facebook_post": "Harga ADA jatuh lebih 40% selepas mencecah $1, mengejutkan ramai pelabur. Ramai beralih kepada Remittix, platform pembayaran rentas sempadan yang menawarkan pulangan lebih pantas dan penyelesaian praktikal.  Masa depan ADA bergantung kepada kejayaan pembangunan dan pelaksanaan ciri-ciri baharu, manakala Remittix dilihat sebagai pilihan menarik bagi mereka yang mahukan pulangan segera.",
            "timestamp": "2025-04-01 06:45:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8c74d0e9e96c66c69569",
            "translated_facebook_post": "Harga RED turun 4.1%, berlegar sekitar $0.5164-$0.5603.  Kalau harga naik lepas $0.56, mungkin akan naik lagi. Tapi kalau tak berjaya, harga mungkin jatuh ke $0.5164.  Pasaran kripto agak tak menentu sekarang, jadi harga RED pun ikut terkesan.  Keadaan pasaran perlu diperhatikan untuk tengok arah aliran seterusnya.",
            "timestamp": "2025-04-01 06:45:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8c74ce114f2936f74b11",
            "translated_facebook_post": "Mata wang kripto REZ melonjak naik lebih 35% sebelum disenaraikan di bursa Bithumb.  Harga meningkat mendadak, tetapi mungkin akan turun selepas pelancaran rasmi.  Penganalisis ada yang nampak potensi kenaikan lagi, ada yang berhati-hati.  Jadi kena pantau rapat pergerakan harga ya!",
            "timestamp": "2025-04-01 06:44:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8b42d0e9e96c66c69560",
            "translated_facebook_post": "Pasaran kripto mula menunjukkan perkembangan positif pada Q2 lepas mengharungi Q1 yang agak lembap. EOS naik mendadak 18%, pecah rintangan utama, manakala Filecoin pun menunjukkan potensi untuk ikut jejak EOS.  Kedua-dua matawang kripto ni menunjukkan potensi untuk terus meningkat.  Tapi ingat, kena buat kajian sendiri sebelum melabur, ya!",
            "timestamp": "2025-04-01 06:44:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8b47d0e9e96c66c69562",
            "translated_facebook_post": "Pasaran kripto agak goyang hari ini, takut perang perdagangan gara-gara pengumuman tarif Presiden Trump.  Walaupun begitu, Bitcoin masih kukuh, naik sikit. Ethereum pun meningkat, manakala altcoins lain macam-macam reaksi. EOS antara yang naik tinggi, Jupiter pula antara yang jatuh.  Secara keseluruhan, pasaran masih berhati-hati.",
            "timestamp": "2025-04-01 06:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://cryptonewsland.com/3-bullish-altcoins-to-buy-before-q2-of-2025/",
            "translated_facebook_post": "Ramai cakap tiga altcoin ni berpotensi naik harga sebelum suku kedua tahun 2025: Cardano, Litecoin, dan Terra Classic.  Cardano makin maju dengan sistem *smart contract* yang lebih baik, Litecoin kekal popular sebab transaksi cepat dan kos rendah, manakala Terra Classic cuba bangkit semula dengan sokongan komuniti yang kuat.  Jadi, kena tengok perkembangan masing-masing sebelum buat keputusan pelaburan.",
            "timestamp": "2025-04-01 06:35:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb8909d0e9e96c66c69555",
            "translated_facebook_post": "Berita terkini pasal Ripple (XRP): Harga XRP jatuh walaupun kes mahkamah dah selesai. Walaupun syiling stablecoin RLUSD mencetak rekod baru,  ramalan harga XRP agak membimbangkan, ada yang jangka harga boleh jatuh ke $1.2 malah $1.07.  Namun, ada juga yang positif dan jangka harga akan naik.  Kesimpulannya, situasi harga XRP masih tak menentu.",
            "timestamp": "2025-04-01 06:32:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67eb890af0dd171955b91f5d",
            "translated_facebook_post": "Pasaran kripto Iran gempar dengan skandal penipuan besar melibatkan pegawai perisikan Pengawal Revolusi Islam.  Pegawai terbabit didakwa menggelapkan aset digital bernilai $21 juta, menjejaskan ribuan pelabur.  Siasatan mendedahkan rasuah berleluasa, dengan pegawai penyiasat sendiri terlibat.  Ramai mangsa masih belum dapat pampasan, dan seorang ketua syarikat kripto dijatuhi hukuman penjara, tetapi berjaya melarikan diri. Kes ini mendedahkan kelemahan kawal selia pasaran kripto Iran.",
            "timestamp": "2025-04-01 06:31:00",
            "status": "Ready for post"
        }
    ]
}