{
    "timestamp": "2025-03-24 04:33:19",
    "all_news": [
        {
            "original_url": "https://en.bitcoinhaber.net/binance-pauses-multiversx-transactions-for-key-update",
            "translated_facebook_post": "Woi gais! Binance tengah stop sementara transaksi MultiversX (EGLD)  sebab nak upgrade sistem diorang, 25 Mac 2025 nanti.  Deposit & withdraw EGLD takleh buat sementara waktu.  Jangan risau, trading EGLD still boleh!  Diorang upgrade untuk keselamatan & bagi lagi smooth sistem diorang.  Settlekan semua transaksi sebelum tarikh tu ye!  Nanti dah siap upgrade, semua okay balik.  Stay tuned utk update selanjutnya! 😉 #Binance #EGLD #crypto #update",
            "timestamp": "2025-03-24 04:18:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0dd4dd6d9e53db600a66c",
            "translated_facebook_post": "Woi gais! 🔥 Tengok ni, ada 3 crypto tengah trending sekarang: Qubetics ($TICS), Bittensor (TAO), & Cronos (CRO)!  Memang power sebab guna teknologi blockchain untuk selesaikan masalah dunia sebenar. Qubetics? VPN yang sangat secure! Bittensor? AI yang decentralized! Cronos?  Bantu perkembangan kewangan!  Potensi untung pun tinggi tau! Jom sertai komuniti!  Details kat link: [Link to article]  #Crypto #Blockchain #Investment #Qubetics #Bittensor #Cronos",
            "timestamp": "2025-03-24 04:15:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://thebitjournal.com/qubetics-hits-new-milestones-as-zignaly-and-filecoin-revolutionize-best-altcoins-to-invest-in-today/",
            "translated_facebook_post": "Woi korang!  Berita best ni!  Qubetics, ZIGnaly & Filecoin tengah  'meletup'! Qubetics, dengan VPN & tokenisasi aset dia, memang power! ZIGnaly pun hebat,  bantu trade crypto guna AI. Filecoin pula,  penyimpanan data terdesentralisasi!  Semua ni potensi besar tau!  Nak tahu lebih lanjut? Jom klik link kat bawah! 😉  #Qubetics #ZIGnaly #Filecoin #Crypto #Pelaburan",
            "timestamp": "2025-03-24 04:15:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0dbd3d6d9e53db600a666",
            "translated_facebook_post": "Woi gais!  Korang tau tak pasal HyroTrader ni?  Dia ni firm prop trading crypto yang tengah meletop sekarang!  Ada platform canggih, support 24/7, & bonus dapat sampai $1 juta tau!  Cabaran dia pun tak susah sangat, cuma kena dapat profit 10% je.  Untungnya lagi, duit cabaran tu boleh dapat balik kalau dah dapat untung!  Sistem diorang telus & payment pun cepat.  Layan sangat! Jom serbu website diorang! #HyroTrader #CryptoTrading #PropFirm #duitraya",
            "timestamp": "2025-03-24 04:13:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://cryptonewsland.com/ethereums-breakout-pattern/",
            "translated_facebook_post": "Eh korang!  Berita best ni!  Ethereum nampak macam nak meletup!  Staking meningkat, harga maintain kuat dekat atas $1950.  Ada potensi naik sampai $2100, malah lebih!  Macam pernah jadi sebelum ni.  Tapi kena tengok jugak, kalau tak pecah $2000, mungkin turun sikit.  Jom tengok apa jadi lepas ni!  #ethereum #crypto #investment  #duitraya",
            "timestamp": "2025-03-24 04:10:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://en.coin-turk.com/binance-temporarily-halts-multiversx-transactions-for-crucial-network-update/",
            "translated_facebook_post": "Eh korang! Binance akan stop sementara transaksi EGLD (MultiversX)  pada 25 Mac 2025, pukul 6.30 petang waktu Turki sebab nak upgrade network.  Upgrade ni untuk keselamatan, guna multisig wallet.  Jangan risau, boleh lagi trade EGLD.  Deposit & withdraw je akan stop sekejap.  Pastikan settle semua transaksi sebelum tu tau!  Bila dah siap upgrade, semua akan kembali normal.  Jom upgrade network untuk masa depan yang lebih selamat! #EGLD #Binance #UpdateNetwork",
            "timestamp": "2025-03-24 04:08:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0daf721eb1213901be79e",
            "translated_facebook_post": "Eh korang! Harga Ethereum stabil dekat $2000 je ni, naik sikit-sikit je.  Walaupun ada turun naik minggu ni, nampak macam okay je.  Ada sorang pakar ni kata harga Ethereum mungkin cecah $4000 tahun 2025.  So, macam best jugak kan?  Jom tengok macam mana nanti! 😉 #Ethereum #Crypto #HargaMataWang",
            "timestamp": "2025-03-24 04:07:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0daf6d6d9e53db600a660",
            "translated_facebook_post": "Woi korang! 🔥 Metaplanet baru je beli lagi 150 Bitcoin, dekat $12.6 juta!  Dah ada 3350 BTC total!  Target diorang nak sampai 10,000 BTC tahun ni & 21,000 BTC tahun depan! Gila tak?  Macam nak pegang 1% Bitcoin seluruh dunia!  Hebat betul strategi diorang ni.  Plus, Eric Trump pun dah join team dorang!  Untung laaa! 😉 #Bitcoin #Metaplanet #Hebat",
            "timestamp": "2025-03-24 04:05:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d970d6d9e53db600a654",
            "translated_facebook_post": "Woi gaiss!  Berita best nih pasal Ethereum!  Harga dia naik sikit dah, dekat $1950.  Ada potensi nak pecah lagi, target $2040! Tapi kena tengok dulu, kalau tak lepas, mungkin turun balik dekat $1880.  Macam main tarik tali la.  Jom tengok apa jadi esok! 🚀🤞 #ethereum #crypto #investasi",
            "timestamp": "2025-03-24 04:03:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d9c9d6d9e53db600a65b",
            "translated_facebook_post": "Woi gais!  Berita best ni!  Ramai cakap pasaran crypto tak menentu, tapi ada beberapa coin tengah naik daun!  Bitcoin, Ethereum, BNB, Solana, dan BlockDAG antara yang hot sekarang.  BlockDAG ni lagi power, presale dia dah cecah $205 juta!  Potensi untung tinggi tau!  Bitcoin tetap kukuh, BNB pun tengah rancak, Solana pantas & Solana ada potensi ETF. Ethereum pun tak kurang hebatnya!  So, korang tengok sendiri lah ye mana yang berkenan di hati. 😉  Buat research sendiri dulu tau!  #crypto #investment #duitraya",
            "timestamp": "2025-03-24 04:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d9c8d6d9e53db600a655",
            "translated_facebook_post": "Woi gais!  Berita best ni! TRX naik, Avalanche pun trending, tapi BlockDAG ni lagi power!  Pre-sale dah cecah $205.5 juta, naik 2380%!  Mainnet & listing kat 10 CEX bakal launch! Macam Bitcoin dulu!  Avalanche guna kat India dah, TRX pun stabil.  Jangan lepaskan peluang BlockDAG ni tau!  Cepat grab sebelum meletop!  Details kat link ni: https://purchase.blockdag.network #BlockDAG #TRX #Avalanche #Crypto",
            "timestamp": "2025-03-24 04:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d9c8d6d9e53db600a657",
            "translated_facebook_post": "Woi gaiss!  ARB jatuh 60% & XRP lembab!  Ramai rugi! Tapi jangan risau, ada BlockDAG!  Diorang bagi reward besar kat program Bug Bounty!  Dah kumpul lebih $205.5 juta dalam presale.  Potensi sampai $600 juta!  Harga BDAG sekarang cuma $0.0248 je.  Cepat grab sebelum naik!  Info lanjut kat link ni: https://purchase.blockdag.network  #BlockDAG #Crypto #BugBounty #ARB #XRP",
            "timestamp": "2025-03-24 04:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d9c821eb1213901be799",
            "translated_facebook_post": "Woi gais! 🔥 Nak kaya cepat? Jom tengok 4 altcoins ni: BlockDAG, Solana, Dogecoin & Cardano!  BlockDAG tengah meletup dengan kenaikan harga 2380%!  Ada bonus 400% lagi tau!  Solana laju, tapi kadang-kadang down.  Dogecoin?  Meme je dulu, sekarang dah jadi duit!  Cardano pulak slow & steady.  Fikir-fikir sendiri la ye.  Bukan nasihat kewangan tau! 😉 #altcoins #crypto #kayacepat #peluangemas",
            "timestamp": "2025-03-24 04:00:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d9c721eb1213901be797",
            "translated_facebook_post": "Woi gais!  Berita Pi Network ni agak huru-hara sikit minggu ni.  Harga jatuh bawah $1 lepas Binance tak nak list dia.  Ramai panik, tapi ada juga yang positif, kata mungkin boleh naik balik sampai $2!  Kita tengok je la macam mana.  Jgn panik, okay? 😉  #PiNetwork #Crypto #HarapanMasihAda",
            "timestamp": "2025-03-24 03:59:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d89cd6d9e53db600a652",
            "translated_facebook_post": "Woi korang!  Korang dengar tak pasal Coinbase kecam Treasury US hal Tornado Cash ni?  Treasury tarik balik sekatan, tapi Coinbase risau dorang letak balik sekatan nanti!  Peguam Coinbase kata tindakan Treasury tu tak clear, boleh timbulkan masalah di masa depan.  Padahal mahkamah dah kata Tornado Cash tu tak salah pun.  Kes ni tunjuk betapa rumitnya peraturan crypto ni, kan?  Agak-agak apa jadi lepas ni? 🤔 #CryptoNews #TornadoCash #Coinbase",
            "timestamp": "2025-03-24 03:58:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d77221eb1213901be792",
            "translated_facebook_post": "Woi korang!  Berita baik! Binance sokong upgrade MultiversX (EGLD) network pada 25 Mac 2025!  Ni upgrade besar, nak bagi lagi smooth & pantas transaksi. Harga EGLD pun naik sikit, trading volume pun melambung!  Harap-harap lepas upgrade ni lagi ramai guna EGLD. Jom kita tengok apa jadi lepas tu! 😎 #EGLD #Binance #Crypto #Upgrade",
            "timestamp": "2025-03-24 03:50:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d612d6d9e53db600a642",
            "translated_facebook_post": "Woi gais!  Berita best ni!  RENDER naik 12% & INJ pun macam nak ikut je!  ETH pun dah cecah $2000!  RENDER dah break out dari falling wedge, target $4.58!  INJ pulak dekat nak breakout jugak, potensi naik sampai $21.16!  Untung besar kalau kena! Tapi ingat, buat research sendiri dulu okay?  Jangan main taruh je! 😉 #crypto #render #inj #ethereum #duitraya",
            "timestamp": "2025-03-24 03:48:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d56debc251202393c0a4",
            "translated_facebook_post": "Woi korang! Tengok ni!  Arctic Pablo Coin tengah meletup! Harga baru $0.000079 je, ROI 10,027.85%!  Cepat grab sebelum terlepas!  Ada lagi Peanut & Ponke pun best jugak.  Jangan tunggu lama-lama, peluang keemasan ni! 😉 #ArcticPabloCoin #crypto #peluangemas",
            "timestamp": "2025-03-24 03:45:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67e0d645d6d9e53db600a646",
            "translated_facebook_post": "Eh korang! Harga ETH ni macam naik turun je dekat $2000 minggu lepas.  Tak berapa nak best la. Walaupun naik sikit hujung minggu, ramai macam tak berapa yakin lagi.  Aliran keluar masuk duit pun kurang.  Ikan paus & pelabur besar pun macam kurang aktif.  Mungkin harga murah ni menarik nanti kalau keadaan pasaran baik sikit.  Kita tengok apa jadi minggu ni pulak! 😉 #ETH #Crypto #PasaranSaham",
            "timestamp": "2025-03-24 03:45:00",
            "status": "Ready for post"
        }
    ]
}