{
    "timestamp": "2025-04-01 10:20:42",
    "all_news": [
        {
            "title": "Watch Out for Dogecoin: Significant Price Drops Ahead",
            "original_url": "https://en.coin-turk.com/watch-out-for-dogecoin-significant-price-drops-ahead/",
            "image_url": "https://en.coin-turk.com/wp-content/uploads/2025/04/dogecoin-1018.jpg",
            "translated_facebook_post": "Harga Dogecoin mungkin akan turun banyak kalau tahap sokongan utama pecah, kata penganalisis. Ethereum pun perlu dipantau rapat,  dan XRP juga berisiko kalau jatuh bawah paras tertentu.  Secara keseluruhannya, pasaran kripto nampak agak mencabar sekarang ni.",
            "timestamp": "2025-04-01 10:08:00",
            "status": "Posted"
        },
        {
            "title": "Why Elon Musk’s Access to SEC Data Is Raising Eyebrows",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebbb6e333c186619ce914b",
            "image_url": "https://www.cointribune.com/app/uploads/2025/04/Elon-Musk-Template.png",
            "translated_facebook_post": "Ramai bimbang dengan akses Elon Musk kepada maklumat sulit SEC.  Keadaan ni mungkin beri dia kelebihan tak adil dalam pasaran, terutamanya dalam industri kripto.  Risiko konflik kepentingan dan manipulasi data amat membimbangkan.",
            "timestamp": "2025-04-01 10:05:00",
            "status": "Posted"
        },
        {
            "title": "Elon Musk's Federal Role: Insights and Market Reactions",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebba38333c186619ce913a",
            "image_url": "https://coincu.com/wp-content/uploads/2025/04/elon-musk-dogecoin-dynamics.png",
            "translated_facebook_post": "Berita tentang Elon Musk dilantik ke jawatan kerajaan sebagai pekerja kerajaan khas selama 130 hari je, buat pasaran kripto, terutamanya Dogecoin, agak tak menentu.  Harga Dogecoin naik turun ikut situasi, dan ramai yang tunggu tengok apa jadi lepas ni.  Nampaknya, ada potensi besar untuk bidang teknologi dan kerajaan bersilang.",
            "timestamp": "2025-04-01 10:02:00",
            "status": "Posted"
        },
        {
            "title": "BREAKING Crypto News: Bitcoin Hits $500,000 on one Exchange – Traders in Shock!",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebba390b3a970402e11a4e",
            "image_url": "https://cryptoticker-strapi-media.s3.eu-central-1.amazonaws.com/freepik_the_style_is_candid_image_photography_with_natural_60555_12aead56d2.jpeg",
            "translated_facebook_post": "Berita mengejut hari ini! Harga Bitcoin naik mendadak sampai $500,000 di satu bursa, Bitget, buat ramai terkejut. Ramai yang cuba ambil peluang, tapi jualan tak berjaya. Ada juga yang kata duit dalam akaun hilang. Rupa-rupanya… berita palsu sempena April Fool’s Day!\n\n\nKesimpulan:  Harga Bitcoin sampai $500,000 di satu bursa,  rupanya berita palsu Hari April Mop!",
            "timestamp": "2025-04-01 10:01:00",
            "status": "Posted"
        },
        {
            "title": "Crypto-Backed Mortgages: A New Way to Buy Homes",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebba370b3a970402e11a4a",
            "image_url": "https://coinomedia.com/wp-content/uploads/2025/04/Crypto-Mortgage.jpg",
            "translated_facebook_post": "Sekarang ni dah ada gadai janji guna duit kripto!  Jadi, korang boleh beli rumah tanpa perlu jual Bitcoin atau Ethereum korang.  Tapi ingat, harga kripto ni turun naik, jadi kena berhati-hati.  Prosesnya mungkin lebih cepat dari bank biasa, tapi pilihan masih terhad.",
            "timestamp": "2025-04-01 10:01:00",
            "status": "Posted"
        },
        {
            "title": "Tether’s Giant Bitcoin Buy: What 8,888 BTC Means for the Market",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebba3762881171b09c0fd4",
            "image_url": "https://captainaltcoin.com/wp-content/uploads/2024/07/Copy-of-P2P-Review-6-2-300x175.png",
            "translated_facebook_post": "Tether, syarikat mata wang kripto, baru je beli Bitcoin sebanyak 8,888 BTC bernilai $735 juta.  Ini bukan kali pertama; pembelian besar sebelum ini juga menyebabkan harga Bitcoin naik.  Kali ini pun, ramai yang jangka harga Bitcoin akan meningkat semula. Walaupun harga sekarang agak turun, pembelian besar Tether ni mungkin petanda positif untuk pelabur jangka panjang.",
            "timestamp": "2025-04-01 10:00:00",
            "status": "Posted"
        },
        {
            "title": "BitTorrent Releases Weekly Report Amidst Market Fluctuations",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb91b333c186619ce9135",
            "image_url": "https://www.kanalcoin.com/wp-content/uploads/2025/04/businessman-focused-office-scene.png",
            "translated_facebook_post": "Laporan mingguan BitTorrent baru-baru ini dedahkan perkembangan terkini projek mereka,  terutamanya strategi baharu yang diadaptasi  menghadapi ketidaktentuan pasaran kripto.  Mereka menekankan komitmen terhadap inovasi dan kerjasama strategik.  Laporan ini dilihat sebagai tindak balas bijak terhadap cabaran semasa.",
            "timestamp": "2025-04-01 09:56:00",
            "status": "Posted"
        },
        {
            "title": "Crypto Hacks Drop in March, But Phishing Scams Still a Major Threat",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebbb6e333c186619ce9149",
            "image_url": "https://thecoinrise.com/wp-content/uploads/2025/04/March-saw-a-significant-decline-in-cryptocurrency-related-losses-from-exploits-hacks-and-scams-totaling-just-28.8-million.jpg",
            "translated_facebook_post": "Kehilangan wang berkaitan kripto menurun pada Mac, cuma $28.8 juta je.  Walaupun begitu,  penipuan dalam bentuk 'phishing' masih menjadi ancaman besar, dengan anggaran kerugian mencecah lebih $46 juta.  Beberapa kes serangan siber berjaya dipulihkan, tapi kena berhati-hati dengan mesej palsu!",
            "timestamp": "2025-04-01 09:56:00",
            "status": "Posted"
        },
        {
            "title": "Shocking Crypto Sell-off: Ethereum Co-founder Vitalik Buterin Dumps Altcoins DHN and LEDOG",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb91a0b3a970402e11a3e",
            "image_url": "https://bitcoinworld.co.in/wp-content/uploads/Shocking-Crypto-Sell-off-Ethereum-Co-founder-Vitalik-Buterin-Dumps-Altcoins-DHN-and-LEDOG.webp",
            "translated_facebook_post": "Pengasas bersama Ethereum, Vitalik Buterin, dilaporkan telah menjual sejumlah besar duit kripto DHN dan LEDOG.  Tindakan ini menyebabkan spekulasi tentang masa depan duit kripto tersebut dan pasaran altcoin secara keseluruhan.  Ia juga mengingatkan kita tentang risiko melabur dalam duit kripto yang kurang dikenali.",
            "timestamp": "2025-04-01 09:55:00",
            "status": "Posted"
        },
        {
            "title": "Best Meme Coin to Buy: How to Spot the Next Viral Crypto",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb91b0b3a970402e11a42",
            "image_url": "https://financefeeds.com/wp-content/uploads/2025/04/Best-Meme-Coin-to-Buy.jpeg",
            "translated_facebook_post": "Baiklah, ini terjemahan berita tersebut dalam Bahasa Malaysia:\n\n\"Pasaran kripto tengah meriah, dan meme coin sekali lagi menjadi topik hangat.  Soalan yang bermain di fikiran setiap pelabur: Meme coin apa yang terbaik untuk dibeli sekarang? Bukan Doge, bukan Shiba.  Yang tengah naik daun pada tahun 2025 ialah Dawgz AI.  Meme coin ni gabung budaya meme yang viral dengan teknologi AI yang canggih.  Ada pilihan staking, bot dagangan, dan komuniti online yang aktif.  Kalau anda rasa meme coin semua sekadar hype, fikirkan semula. Dawgz AI tengah mendahului dengan gabungan tenaga viral dan utiliti blockchain yang praktikal.  Ia menawarkan peluang pelaburan awal pada harga rendah, ganjaran staking serta penggunaan bot dagangan AI.  Dawgz AI juga telus dan selamat, dengan audit kontrak pintar yang telah dilakukan.  Secara ringkasnya, Dawgz AI nampaknya berpotensi untuk berkembang pesat.\"\n\n\nKesimpulan:\n\nDawgz AI, meme coin baru,  gabung kelebihan budaya meme viral dengan teknologi AI canggih, menawarkan potensi pelaburan menarik menerusi ganjaran staking dan bot dagangan.",
            "timestamp": "2025-04-01 09:55:00",
            "status": "Posted"
        },
        {
            "title": "5 Under $1 Cryptos Ready to Explode—Expert Predictions Point to 20,000% Gains by Q4 2025!",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb7e90b3a970402e11a3b",
            "image_url": "https://en.bitcoinsistemi.com/wp-content/uploads/2025/04/17435011248152030-image2.png",
            "translated_facebook_post": "Beberapa kripto berharga bawah $1 dijangka naik mendadak, mungkin sampai 20,000% menjelang akhir 2025.  Pelaburan awal dalam projek seperti XYZVerse, yang menggabungkan sukan dan kripto,  menawarkan potensi pulangan tinggi.  LUNC, XLM, HBAR, dan TRX juga menunjukkan potensi yang menarik.",
            "timestamp": "2025-04-01 09:52:00",
            "status": "Posted"
        },
        {
            "title": "Japan to strongly advocate for exemption from U.S. auto tariffs",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb91a62881171b09c0fd1",
            "image_url": "https://www.cryptopolitan.com/wp-content/uploads/2025/04/japan-to-advocate-for-exemption.webp",
            "translated_facebook_post": "Jepun akan usaha kuat dapatkan pengecualian cukai import kereta dari Amerika Syarikat.  Mereka akan ambil langkah mitigasi kesan negatif cukai tersebut kepada ekonomi dan pekerjaan.  Peningkatan kos sara hidup dan inflasi juga menjadi kebimbangan.  Jepun akan cuba dapatkan kenaikan gaji untuk seimbangkan kos sara hidup yang meningkat.",
            "timestamp": "2025-04-01 09:51:00",
            "status": "Posted"
        },
        {
            "title": "Bye Bye Europe: As Binance’s Official Stopped Its USDT Trading in the EEA Region",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb7e862881171b09c0fcb",
            "image_url": "https://image.coinpedia.org/wp-content/uploads/2024/12/18162425/Binance-to-Delist-SUI-HMSTR-BNT-CYBER-and-AEUR-on-December-20.webp",
            "translated_facebook_post": "Binance dan beberapa bursa kripto lain dah henti dagangan USDT dan beberapa stablecoin lain di Eropah sebab nak patuh peraturan baru MiCA.  Pengguna masih boleh pegang dan dagang stablecoin tu guna kontrak perpetual, cuma pilihan spot trading dah tak ada.  Beberapa stablecoin lain pun terkesan.",
            "timestamp": "2025-04-01 09:51:00",
            "status": "Posted"
        },
        {
            "title": "Why is Ethereum (ETH) price up today?",
            "original_url": "https://coinmarketcap.com/community/en/articles/65bbe3071f33205a09382fc7",
            "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDgvNjJhOWU5MTEtNDNhMi00Y2M0LTkyYTEtZjQ4MTlkOGYwZGI1.jpg",
            "translated_facebook_post": "Harga Ethereum (ETH) naik disebabkan beberapa faktor. Pelancaran Privacy Pools, pengurangan bekalan ETH di bursa, dan peningkatan pengumpulan oleh pelabur besar memberi impak positif.  Ramalan menunjukkan harga mungkin meningkat sehingga 12%.  Secara ringkasnya, gabungan inovasi, strategi pelaburan, dan momentum pasaran menaikkan harga ETH.",
            "timestamp": "2025-04-01 09:51:00",
            "status": "Posted"
        },
        {
            "title": "More Red on the Horizon for BTC While Analyst Sets Cycle Top Target for Altcoin VELO at $0.95 – $1.65",
            "original_url": "https://cryptonewsland.com/more-red-on-the-horizon/",
            "image_url": "https://cryptonewsland.com/wp-content/uploads/2025/03/Altcoin-VELO.jpg",
            "translated_facebook_post": "Harga Bitcoin dijangka turun lagi sebelum naik semula, mungkin mencecah antara $50,000 hingga $60,000.  Walaupun begitu, ramai masih positif tentang masa depan Bitcoin.  Seorang penganalisis pula jangka harga altcoin VELO akan naik mendadak, antara $0.95 hingga $1.65.",
            "timestamp": "2025-04-01 09:50:00",
            "status": "Posted"
        },
        {
            "title": "Bitcoin (BTC) has hit the Bottom: Is the Trend Reversal Starting Now?",
            "original_url": "https://coinmarketcap.com/headlines/news/bitcoin-btc-has-hit-the-bottom-is-the-trend-reversal-starting-now/",
            "image_url": "https://images.cryptodaily.co.uk/space/Bitcoin%20hits%20bottom%20now%20trend%20reversal%201.jpg",
            "translated_facebook_post": "**Translation:**\n\nBitcoin (BTC) dah cecah paras terendah: Adakah pembalikan trend bermula sekarang?\n\nAda tanda-tanda yang menunjukkan Bitcoin dah sampai ke paras terendah, susulan trend menurun sejak 20 Januari tahun ini. Dalam tempoh itu...\n\n\n**Conclusion:**\n\nNampaknya Bitcoin dah sampai ke tahap paling rendah.  Mungkin ni tanda harga akan naik balik, tapi kita tengok dulu perkembangan selanjutnya.",
            "timestamp": "2025-04-01 09:48:00",
            "status": "Posted"
        },
        {
            "title": "Bybit Leads March Capital Inflows and Reclaims No. 2 Spot in Global Trading Volume",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb6a50b3a970402e11a33",
            "image_url": "https://financefeeds.com/wp-content/uploads/2022/03/official-image.png",
            "translated_facebook_post": "Translation (Malay):\n\nBybit pulih dengan memberangsangkan pada Mac lalu,  mencatatkan kemasukan modal bersih sebanyak $3.61 bilion dan kembali ke kedudukan kedua sebagai bursa kripto terbesar di dunia.  Kejayaan ini menunjukkan tindak balas pantas Bybit terhadap cabaran baru-baru ini, sambil mengekalkan keselamatan dan ketelusan kepada pengguna.  Bybit mengetuai aliran masuk modal di kalangan semua bursa terpusat pada bulan Mac 2025, dengan $3.61 bilion modal baharu yang diterima, meningkatkan Jumlah Nilai Terkunci (TVL) kepada $14.9 bilion.  Peningkatan ketara ini, sebanyak $612.62 juta dalam tempoh tujuh hari dan $3.61 bilion sepanjang bulan, didorong oleh peningkatan kepercayaan pengguna hasil daripada fokus Bybit terhadap peningkatan keselamatan dan ketahanan operasi.  Bybit juga berjaya mengembalikan kedudukan kedua dalam jumlah dagangan pada Mac 2025, sebahagian besarnya disebabkan oleh penambahbaikan dalam penyediaan harga runcit (RPI) yang meningkatkan kecairan untuk pasangan dagangan utama seperti BTC/USDT dan ETH/USDT.  Walaupun krisis baru-baru ini, Bybit beroperasi tanpa gangguan, menyokong pengeluaran dan melancarkan token baharu, serta meneruskan program ganjaran mereka. Inovasi dan penglibatan pengguna juga diteruskan dengan pelancaran empat token baharu dan pelbagai promosi.  Bybit komited terhadap kepercayaan dan keselamatan pengguna, melabur secara berterusan dalam ketelusan dan program anti-pengubahan wang haram.\n\n\nConclusion (Malay):\n\nBybit bangkit semula dengan cemerlang pada Mac lepas, mencatat aliran masuk modal tinggi dan kembali sebagai bursa kripto kedua terbesar dunia.  Kejayaan ini hasil fokus pada keselamatan, inovasi, dan kepuasan pengguna.",
            "timestamp": "2025-04-01 09:46:00",
            "status": "Posted"
        },
        {
            "title": "Cryptocurrency Market Braces for Trump’s April 2 Tariff Policy Shockwave",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb6a5ba151764e4ccb171",
            "image_url": "https://bitcoinworld.co.in/wp-content/uploads/Cryptocurrency-Market-Braces-for-Trumps-April-2-Tariff-Policy-Shockwave.webp",
            "translated_facebook_post": "Bekas Presiden Donald Trump akan umumkan dasar tarif baharu pada 2 April.  Ini mungkin akan menjejaskan pasaran kripto, mungkin naik, mungkin turun.  Jadi, eloklah berhati-hati dan pantau perkembangannya.",
            "timestamp": "2025-04-01 09:45:00",
            "status": "Posted"
        },
        {
            "title": "Brett Created Millionaires—Arctic Pablo Joins the Ranks of Top New Meme Coins for Exponential Returns",
            "original_url": "https://coinmarketcap.com/community/en/articles/67eba8034947423a49f77238",
            "image_url": "https://academy-public.coinmarketcap.com/srd-optimized-uploads/ab8460909bd44889a91ab7e21c81a349.png",
            "translated_facebook_post": "Berita tentang  Arctic Pablo Coin, satu lagi matawang kripto jenis *meme coin* yang tengah naik.  Ia guna pendekatan unik dengan jualan awal berperingkat, membakar token yang tak terjual, dan ada program *staking* dengan pulangan tinggi.  Pelaburan awal nampaknya berpotensi untung besar, tapi macam biasa, risiko pelaburan dalam kripto tetap tinggi.",
            "timestamp": "2025-04-01 09:45:00",
            "status": "Posted"
        },
        {
            "title": "Arctic Pablo Coin’s Presale Growth, Dog (Bitcoin)’s Meme Nostalgia, and Mog Coin’s Engaged Community – Must-Watch Meme Coins",
            "original_url": "https://coinmarketcap.com/community/en/articles/67ebb6a60b3a970402e11a35",
            "image_url": "https://thecoinrise.com/wp-content/uploads/2025/03/1-793.png",
            "translated_facebook_post": "Sekarang ni, ramai berminat dengan mata wang kripto jenis meme coin, macam Arctic Pablo Coin, Dog (Bitcoin), dan Mog Coin.  Arctic Pablo Coin tengah naik daun sebab presale dia,  Dog (Bitcoin) pulak popular sebab nostalgia Bitcoin, dan Mog Coin aktif dengan komuniti dia.  Pelaburan dalam mata wang ini berisiko, tetapi berpotensi untung besar jika pandai pilih masa.",
            "timestamp": "2025-04-01 09:45:00",
            "status": "Posted"
        }
    ]
}