{
    "timestamp": "2025-03-21 08:04:26",
    "all_news": [
        {
            "original_url": "https://coinpedia.org/news/pi-coin-expriences-sharp-decline-over-20-token-unlock-to-make-it-worse/",
            "translated_facebook_post": "Woi korang!  Pi Coin jatuh teruk, dah kurang 20%!  Harga dah bawah $1.  Ramai tak puas hati sebab lambat list kat Binance & Coinbase.  Tambah pulak isu mainnet launch tak clear, ramai dah syak scam.  Ada sorang mamat ni siap cakap Pi Network ni centralized, teknologi pun copy paste dari Stellar!  Nak tambah lagi,  129 juta Pi coin nak unlock nanti, lagi la harga jatuh!  Korang kena hati-hati tau!  Jgn sampai rugi! 😬 #PiCoin #Crypto #ScamAlert",
            "timestamp": "2025-03-21 07:53:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinpedia.org/price-analysis/pi-network-price-prediction-can-pi-price-recover-50-monthly-loss-close-the-q1-trade-above-1/",
            "translated_facebook_post": "Eh korang!  Harga Pi Network jatuh teruk ni, dah bawah $1!  Rugi 50% sebulan!  Ramai takut.  Tapi ada juga yang cakap mungkin akan naik balik sebab duit Pi dah makin sikit (burned).  Teknikal pun macam nak rebound, tapi masih tak pasti.  Banyak lagi halangan, macam mainnet lambat, Binance tak list lagi, dan gosip scam.  Hati-hati la ye sebelum melabur! #PINetwork #Crypto #HargaPi",
            "timestamp": "2025-03-21 07:51:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd1b309f0d452f48464541",
            "translated_facebook_post": "Wooohooo! Gilaaa… Tau tak?  Sheikh Tahnoon dari UAE jumpa David Sacks (si \"crypto czar\" zaman Trump!).  Meeting besar ni buatkan ramai bincang pasal masa depan kewangan digital.  UAE makin serius pasal crypto, siap nak jadi hab inovasi!  Amerika pun sama, nampaknya.  Best ni!  Banyak peluang pelaburan kot! Jom kita tengok apa jadi lepas ni!  #crypto #UAE #USA #kewangandigital #peluangpelaburan",
            "timestamp": "2025-03-21 07:50:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://en.bitcoinhaber.net/bitcoin-surges-past-key-resistance-level-2",
            "translated_facebook_post": "Woi korang! Bitcoin naik mendadak lepas pecah halangan harga penting!  Dah lepas 200-day EMA tu, kira bagus la tu. Tapi kena lagi pecah satu lagi halangan dekat $85,400.  Volume dagangan pun naik, maknanya ramai orang minat.  Jom tengok apa jadi lepas ni!  Semoga terus naik! 🚀🤞 #Bitcoin #Crypto #BeritaBaik",
            "timestamp": "2025-03-21 07:48:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd1a03daafe4487069ed6f",
            "translated_facebook_post": "Woi gaiss! Tau tak Pump.fun dah launch DEX sendiri, PumpSwap!  Mmg senang gila, token Pump.fun terus pindah ke PumpSwap lepas siap bonding curve.  Tak yah bayar 6 SOL lagi!  Best kan?  Ada peluang creator dapat share untung jugak!  PumpSwap ni mcm Uniswap & Raydium, cuma fee dia 0.25% je.  Alon Cohen cakap ni langkah penting utk Pump.fun terus maju.  Dulu agak tension sikit sbb ada isu dgn Raydium, tp now dah settle.  So, jom ramai2 serbu PumpSwap! 😎",
            "timestamp": "2025-03-21 07:46:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd1b309f0d452f4846453f",
            "translated_facebook_post": "Woi gais! Harga Kaspa (KAS) hari ni macam down sikit, 6.5% turun jadi $0.075.  Macam tersekat kat $0.080 minggu ni. Tapi indicator macam RSI, MACD, CCI bagai bagi signal macam nak konsolidasi je dulu.  Jangkaan harga hari ni dalam $0.072-$0.078. Kalau untung besar, maybe boleh cecah $0.080 balik, tapi kena tengok volume trading la. Kalau rugi, mungkin jatuh sampai $0.070.  So, tunggu je dulu perkembangan selanjutnya.  Stay tuned! 😉 #Kaspa #Crypto #HargaCrypto",
            "timestamp": "2025-03-21 07:45:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd189b88d5347a28135e66",
            "translated_facebook_post": "Woi korang!  Korang tau tak pasal Shiba Inu?  Dulu harga dia murah gila, tapi sekarang?  Ramai dah jadi jutawan!  Sekarang ada satu lagi coin, Arctic Pablo Coin (APC), tengah pre-sale.  Potensi untung macam Shiba Inu jugak tau!  Harga sekarang cuma $0.000079, tapi nanti naik sampai $0.008!  Untung boleh cecah 10,000%!  Cepat sikit grab sebelum terlepas!  Info lanjut kat https://www.arcticpablo.com/  Jom kaya sama-sama! 😉 #ArcticPabloCoin #MemeCoin #Crypto",
            "timestamp": "2025-03-21 07:43:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd18d9daafe4487069ed67",
            "translated_facebook_post": "Woi gais!  Ramai tanya pasal CEL coin kan?  Rasa macam nak cecah $1 ke tak menjelang 2030?  Prediction kata maybe boleh cecah $0.31 dalam 2025,  tapi sampai $3 pun ada kemungkinan!  Banyak faktor, termasuklah adoption ramai-ramai.  So, tengok jelah macam mana nanti.  Risiko sendiri tau! 😉 #CEL #Crypto #Prediction #InvestBijak",
            "timestamp": "2025-03-21 07:41:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd18d89f0d452f48464533",
            "translated_facebook_post": "Woi korang! Gila betul kes Bithumb ni!  Pihak berkuasa Seoul serbu bursa kripto tu sebab CEO lama didakwa salah guna dana syarikat, siap beli apartment mewah guna duit company!  Habis goyang industri kripto Korea Selatan.  Ni satu warning besar untuk semua bursa kripto lain supaya jaga-jaga bab governance &  ketelusan.  Kena hati-hati la korang, jaga duit masing-masing!  Nak update pasal crypto? Subscribe newsletter kami! 😉",
            "timestamp": "2025-03-21 07:40:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd1b31c3940b22603a2aa1",
            "translated_facebook_post": "Woi gais! Bitcoin naik mendadak sampai $87,453 sebab spekulasi pasal ucapan Trump kat Digital Asset Summit.  Tapi hampa tau kan, bila Trump cakap, harga Bitcoin terus jatuh balik!  Rupa-rupanya takde announcement menarik pasal cukai ke, simpanan Bitcoin kerajaan ke.  Alahai, hampa yang beli Bitcoin sebab spekulasi tu, rugi la tu!  Ada analis kata mungkin lagi jatuh sampai $73,700.  Tapi jangan risau sangat, ada juga berita baik pasal Fed yang mungkin bagi peluang Bitcoin naik balik.  Apa-apa pun, tetap berhati-hati, ye!  #Bitcoin #Trump #Crypto #trading",
            "timestamp": "2025-03-21 07:40:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd18d8daafe4487069ed65",
            "translated_facebook_post": "Wow!  Berita best!  Bitcoin ETF melonjak 1300%!  Semua gara-gara Fed tak naikkan kadar faedah.  Masuk duit $165 juta dalam sehari! BlackRock punya IBIT paling untung.  Tapi ada jugak yang rugi.  Bitcoin naik sikit, pastu turun balik.  Ada yang kata bullish, ada yang bearish.  Macam-macam pendapat, pening kepala!  Kesimpulannya?  Tak pasti lagi hala tuju Bitcoin, tapi nampaknya ramai masih berminat! 😎",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd17b6c3940b22603a2a8c",
            "translated_facebook_post": "Wooohooo! MEXC & pump.fun bergabung! 🤩  MEXC DEX+  skang lagi kolaborasi dgn pump.fun, launchpad token yg happening tu!  Senang je nak trade token baru kat DEX+ ni, terus dari app MEXC.  Dapat akses awal tau!  Ada reward 20 USDT jugak kalau trade 100 USDT ke atas! Jom sertai!  🔥  Link kat bawah! 😉 #MEXC #pumpfun #DEX #crypto",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd1b309f0d452f48464543",
            "translated_facebook_post": "Eh korang!  Dengar ni, ada cikgu kat Korea Selatan kena penjara sebab curi duit student beli crypto!  80 juta won tau!  Dia siap jual barang terpakai online lagi, dapat 7 juta won.  Walaupun duit dah bayar balik, tetap kena penjara 2 tahun.  Ramai sangat kes macam ni sekarang kat Jeju, dah lebih 150 kes!  Korea Selatan ni memang tengah naik gila dengan crypto, pengguna dah 30% dari populasi negara tu.  Tapi kerajaan tangguh cukai keuntungan modal sampai 2027.  Kesian student tu, harap cikgu tu insaf la lepas ni! 😅",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd18d9c3940b22603a2a97",
            "translated_facebook_post": "Wooohooo! Nilai pasaran stablecoin dah cecah $230 billion!  Hebat kan?  Ramai pelabur besar masuk, tambah pulak dengan sokongan Trump & undang-undang baru kat US.  USDT masih juara!  Lepas jatuh teruk dulu, sekarang naik balik.  Ni semua sebab makin ramai guna stablecoin untuk transaksi antarabangsa.  Masa depan crypto nampak cerah! 🚀",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd18d89f0d452f48464535",
            "translated_facebook_post": "Woi korang!  Lightchain AI ni tengah meletop!  Presale dia dah kutip $17.9 juta!  Gabungan AI & blockchain, memang power!  Ramai cakap boleh lawan Dogecoin tau! Harga sekarang $0.007, tapi ada yang jangka boleh cecah $5!  Fuh, untung besar kalau masuk awal!  Jangan lupa buat research sendiri yer!  Bukan nasihat pelaburan ni. 😉 #LightchainAI #Crypto #Dogecoin",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://en.coin-turk.com/bitcoin-breaks-key-resistance-level-shaping-market-sentiment/",
            "translated_facebook_post": "Woi gais! Bitcoin pecah halangan utama!  Harga dah naik lepas lama stuck.  Sekarang tengah cuba kekal atas $84,600.  Tapi masih ada lagi halangan dekat $85,400.  Kalau lepas ni,  boleh naik lagi tinggi!  Volume perdagangan pun tinggi,  so nampak macam ramai orang beli.  Jom tengok apa jadi next! #Bitcoin #Crypto #NaikHarga",
            "timestamp": "2025-03-21 07:39:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd17c59f0d452f4846452b",
            "translated_facebook_post": "Woi korang!  Korang tau tak? Admin Trump dulu nak guna blockchain utk USAID! Gila kan?  Nak tukar nama USAID jugak, jadi U.S. International Humanitarian Assistance.  Kononnya nak lebih telus & cekap bagi bantuan.  Ada yg cakap nak guna cryptocurrency jugak kot utk bagi bantuan, macam stablecoin.  Macam best je bunyinya, tapi macam mana nanti? Kita tengok je la!  #USAID #Blockchain #Trump #Crypto #BeritaDunia",
            "timestamp": "2025-03-21 07:38:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd17c59f0d452f48464529",
            "translated_facebook_post": "Woi korang! Tau tak? Token Orca kat Solana tu naik 92% lepas masuk Upbit! Gila tak? 🚀  Harga cecah $3.29! Volume trading pun meletop!  Ni peluang keemasan untuk masuk pasaran Asia katanya.  Tapi ingat, crypto ni volatile tau!  Jom kaya sama-sama! 😉 #OrcaToken #Solana #Upbit #Crypto",
            "timestamp": "2025-03-21 07:35:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://cryptonewsland.com/3-promising-altcoins-to-buy-in-q1-of-2025/",
            "translated_facebook_post": "Woi korang!  Bitcoin nak cecah $200k, so jom tengok 3 altcoin yang berpotensi tinggi untuk Q1 2025: Ethereum (ETH) -  best untuk DeFi & NFT, Binance Coin (BNB) -  guna kat Binance exchange, dan Toncoin (TON) -  blockchain super laju!  Semua ni ada potensi untung besar tau!  Jangan lepaskan peluang! 😉 #altcoin #crypto #investment #bitcoin",
            "timestamp": "2025-03-21 07:35:00",
            "status": "Ready for post"
        },
        {
            "original_url": "https://coinmarketcap.com/community/en/articles/67dd167f9f0d452f48464517",
            "translated_facebook_post": "Tahniah Adetunji Opayele dari Bumpa!  🎉  Korang tengok ni, dah sampai CoinMarketCap!  Hebat betul! 😎  Link kat bawah kalau nak tengok sendiri.  [link]",
            "timestamp": "2025-03-21 07:33:00",
            "status": "Ready for post"
        }
    ]
}